[
  {"q": "what is phishing?", "a": "Phishing is a social engineering attack where attackers trick you into revealing credentials or sensitive data using deceptive emails or websites."},
  {"q": "how to spot phishing", "a": "Check the sender domain, hover links for real URLs, look for typos, urgent tone, requests for credentials, and avoid clicking attachments."},
  {"q": "what is mfa", "a": "MFA (Multi-Factor Authentication) adds a second factor like an authenticator app or hardware key to your login."},
  {"q": "enable mfa", "a": "Enable MFA in your account security settings and prefer an authenticator app or security key over SMS."},
  {"q": "password best practices", "a": "Use long unique passwords, a password manager, and enable MFA. Avoid reuse."},
  {"q": "what is ransomware", "a": "Ransomware encrypts files and demands payment. Keep offline backups and patch systems."},
  {"q": "safe public wifi", "a": "Avoid sensitive actions on public Wi‑Fi. Use a VPN and HTTPS. Turn off auto-join."},
  {"q": "how to update software", "a": "Turn on automatic updates, patch promptly, and keep apps, OS, browser, and plugins current."},
  {"q": "what is social engineering", "a": "Manipulating people into performing actions or revealing information, often via pretexting or phishing."},
  {"q": "secure home wifi", "a": "Use WPA2/WPA3, strong unique passphrase, change default router password, and disable WPS."},
  {"q": "vpn benefits", "a": "VPN encrypts traffic and hides your IP on untrusted networks, but does not make you anonymous."},
  {"q": "what is zero trust", "a": "Zero Trust means never trust, always verify. Authenticate and authorize every request."},
  {"q": "what is 2fa", "a": "2FA is two‑factor authentication. Prefer TOTP or security keys."},
  {"q": "phishing examples", "a": "Fake package delivery notices, fake password reset emails, and unexpected invoice attachments are common."},
  {"q": "how to backup", "a": "Follow 3‑2‑1 rule: 3 copies, 2 media types, 1 offsite/offline backup."},
  {"q": "what is dns", "a": "DNS translates domain names to IP addresses. Secure with DNS over HTTPS (DoH)."},
  {"q": "what is https", "a": "HTTPS encrypts web traffic using TLS, protecting data integrity and confidentiality."},
  {"q": "what is tls", "a": "TLS is the protocol that secures data in transit on the web (HTTPS)."},
  {"q": "detect malware", "a": "Unusual CPU/network activity, popups, unknown processes, and file changes can indicate malware."},
  {"q": "strong password", "a": "Use 14+ characters, mix cases, digits, symbols; passphrases are great."},
  {"q": "what is data breach", "a": "A data breach exposes confidential information. Change passwords, enable MFA, and monitor accounts."},
  {"q": "should I click link", "a": "If unexpected, verify with the sender via another channel; hover to inspect the URL carefully."},
  {"q": "public usb risk", "a": "Avoid public USB charging ports; use a USB data blocker or your own charger."},
  {"q": "what is shoulder surfing", "a": "Someone watching your screen or keyboard to steal information. Use screen privacy filters."},
  {"q": "what is spear phishing", "a": "A targeted phishing attack tailored to a specific person or organization."}
]